{
	"_meta": {
		"sources": [
			{
				"json": "FftF",
				"abbreviation": "FftF",
				"full": "Feats for the Fearsome",
				"version": "1",
				"url": "https://www.patreon.com/posts/feats-for-16156471",
				"authors": [
					"Mage Hand Press"
				],
				"convertedBy": [
					"MelodyMSG"
				],
				"color": "f9f06b"
			}
		]
	},
    "feat": [
        { 
            "name": "Blindfighter",
            "source": "FftF",
            "prerequisite": [
                {
                    "ability": [
                        {
                            "wis": 13
                        }
                    ]
                }
            ],
            "entries": [
            	"You fight exceptionally well, even when you can't see. As long as you can hear, you do not have disadvantage on attack rolls you make against targets within 10 feet of you, and attack rolls against you do not have advantage as a result of a {@condition darkness}, a {@condition heavily obscured} area, the attacker being {@condition invisible}, or you being {@condition blinded}."
            ]
        },
        { 
            "name": "Brutal Grip",
            "source": "FftF",
            "ability": [
                {
                    "str": 1
                }
            ],
            "entries": [
                "You've learned to use the weight of your weapons effectively, and have adapted to use large weapons one-handed.",
                {
                    "type": "list",
                    "items": [
                        "When wielding a versatile weapon in one hand, you may use the two-handed damage die.",
                        "You may wield a two-handed melee weapon in one hand, treating it as a one-handed weapon. You have disadvantage on attack rolls made when wielding a two-handed weapon this way."
                    ]
                }
            ]
        },
        { 
                "name": "Detective",
                "source": "FftF",
        "ability": [
                    {
                        "int": 1
                    }
                ],
                "entries": [
                    "Your keen eye for details and mechanical acuity give you a wide set of tools to unravel any mystery that presents itself. You gain the following benefits:",
                    {
                        "type": "list",
                        "items": [
                            "By spending 1 minute examining a corpse that has been dead for no longer a month, you can automatically determine its cause of death.",
                            "Whenever you make a successful Intelligence (Investigation) check, you gain a +2 bonus on subsequent Intelligence (Investigation) checks you make that relate to the same topic (for example, examining multiple pieces of evidence to a single murder.) These bonuses stack with multiple successes (up to a maximum of +10), but a failed check reverts your bonus to +0.",
                "By spending 1 minute studying a humanoid you can see, you can learn 1 thing, chosen by the GM: the target's alignment (either good/evil or lawful/chaotic, but not both), one of the target's bonds, or one of its flaws."
                        ]
                    }
                ]
        },
        { 
                "name": "Dilettante",
                "source": "FftF",
                "entries": [
                    "With a few minutes of preparation, a bit of improvisation, and some talent, you can appear proficient in just about anything. When you finish a long rest, you can spend 10 minutes practicing with a skill or tool to become proficient in it until you finish a long rest"
                ]
        },
        { 
                "name": "Early Riser",
                "source": "FftF",
                "entries": [
                    "By following a strict routine, you've become accustomed to resting less than others. You gain the full benefit of taking a long rest in only 4 hours, and you gain the full benefit of taking a short rest in only 30 minutes. Additionally, you regain all your expended hit dice, rather than half of them, when you take a long rest."
                ]
        },
        { 
                "name": "Escape Artist",
                "source": "FftF",
        "ability": [
                    {
                        "dex": 1
                    }
                ],
                "entries": [
                    "You are practiced in picking locks and slipping any type of bond, and can even do so blindfolded. You gain the following benefits",
                    {
                        "type": "list",
                        "items": [
                            "You have advantage on ability checks you make to slip bonds or escape {@condition grapple}.",
                            "You can hold your breath for twice as long as normal for your race/ability scores.",
                "You have advantage on ability checks you make to pick locks, and you can do so without {@item thieves' tools|PHB|thieve's tools}, as long as you have some suitable instrument. Moreover, you can pick locks one-handed and when {@condition blinded}."
                        ]
                    }
                ]
        },
        {
                "name": "Familiar Keeper",
                "source": "FftF",
                "entries": [
                    "You learn the {@spell find familiar|PHB|find familiar} spell, and can cast it as a ritual without expending spell components. Additionally, you can choose the following forms for you familiar: {@creature imp}, {@creature pseudodragon}, {@creature quasit}, or {@creature sprite}.",
                    "If you gain the ability to cast this spell by another means, you can maintain two familiars at once."
                ]
        },
        {
            "name": "Field Commander",
            "source": "FftF",
            "ability": [
                {
                    "cha": 1
                }
            ],
            "entries": [
                "Under your leadership, your allies fight as a cohesive unit, outmaneuvering and outflanking any enemy. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "As an action, you can issue an order to an ally within 60 feet that can hear you. They can then use their reaction to take one of the following actions: {@action Attack} (one attack only), {@action Dash}, {@action Disengage}, {@action Dodge}, {@action Help}, {@action Hide}, {@action Search}, or {@action Use an Object}.",
                        "While you are within 5 feet of two or more allies who aren't {@condition incapacitated}, hostile creatures can't have advantage on attack rolls against you."
                    ]
                }
            ]
        },
        {
                "name": "Focused Critical",
                "source": "FftF",
                "entries": [
                    "You've honed your combat skills to seize on any opening you're presented. When you choose this feat, select ranged weapon attacks or melee weapon attacks. You score a critical hit on a roll of 19 or 20 with attack rolls of that type.",
            "You can choose this feat more than once, selecting a different attack type each time."
                ]
        },
        {
                "name": "Gatecrasher",
                "source": "FftF",
        "prerequisite": [
            {
                        "ability": [
                            {
                                "str": 13
                            }
                        ]
            }
        ],
                "entries": [
                    "Whereas others inch cautiously through dungeons and stealthily scale enemy fortifications, you've found it easier to barrel right through your obstacles. You gain the following benefits:",
                    {
                        "type": "list",
                        "items": [
                            "You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be {@condition blinded}, {@condition deafened}, or {@condition incapacitated}.",
                            "You have advantage on Strength checks you make to break down doors and demolish obstacles.",
                            "When you make a successful {@action Shove} action against a creature holding a shield, you can choose to disarm the target of the shield instead of pushing it or knocking it {@condition prone}. You can hold the shield yourself or throw it to any location within 30 feet."
                        ]
                    }
                ]
        },
        {
            "name": "Gifted Spellcaster",
            "source": "FftF",
            "prerequisite": [
                {
                    "otherSummary": {
                        "entry": "Spellcasting feature, spellcacting ability 13+",
                        "entrySummary": "Spellcasting"
                    }
                }
            ],
            "entries": [
                "Thanks to study, or simply deep introspection, you have expanded your magical potential. You learn 4 spells of your choice of 7th level or lower from your class's spell list. These spells must be for a level for which you have spell slots."
            ]
        },
        {
            "name": "Hedge Magic",
            "source": "FftF",
            "prerequisite": [
                {
                    "otherSummary": {
                        "entry": "5th level",
                        "entrySummary": "Lv 5+"
                    }
                }
            ],
            "entries": [
                "You are self-educated in the ways of arcana. Having learned much through experimentation and practice, you have gained exceptional insight into lower level spells. You learn one cantrip of your choice from any class's spell list. Your spellcasting ability for this cantrip is your choice of Intelligence, Wisdom, or Charisma. Once you make this choice, it can't be changed.",
                "Additionally, cantrips you know become more potent: when you cast a cantrip that deals damage, you deal one additional die of damage to one of the cantrip’s targets."
            ]
        },
        {
            "name": "Iron Hero",
            "source": "FftF",
            "entries": [
                "You have resolved yourself to save the day when all hope seems lost. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When in combat against a creature that has a CR higher than your level, you gain a +2 bonus to your AC.",
                        "You have advantage on attack rolls against any creature that has reduced one of your allies to 0 hit points in the last round.",
                        "If a hostile creature you can see takes a legendary action, you can use your reaction to intercede, preventing the legendary action from happening. Once you use this ability, you can't use it again until you finish a short or long rest"
                    ]
                }
            ]
        },
        {
            "name": "Javelineer",
            "source": "FftF",
            "prerequisite": [
                {
                    "otherSummary": {
                        "entry": "{@feat Master Thrower|FftF|Master Thrower} feat, proficiency with {@weapon javelins}",
                        "entrySummary": "Prof javelins/Master Thrower"
                    }
                }
            ],
            "entries": [
                "Thanks to your advanced skills, you are far more deadly with a javelin than most warriors. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you hit a target with a thrown javelin, it sticks into their body, shield, or armor, slowing them down. Their base walking speed is reduced by 10 feet until they use an action to remove the javelin.",
                        "If you move at least 25 feet in a straight line on your turn, you have advantage on the first attack you make with a thrown javelin on that turn, as long as you are not indoors or underground.",
                        "Before you make a thrown attack with a javelin, you can choose to take a -5 penalty to the attack roll. If the attack hits, you add +10 to the attack’s damage."
                    ]
                }
            ]
        },
        {
            "name": "Magician",
            "source": "FftF",
            "entries": [
                "Whereas true spellcasters weave profound arcane secrets into runes and gestures to produce incredible works of magic, you merely pretend to for others' amusement. You learn the {@spell prestidigitation|PHB|prestidigitation} cantrip, with the following improvements:",
                {
                    "type": "list",
                    "items": [
                        "The spell's range is 120 feet.",
                        "You can maintain any number of the spell's non-instantaneous effects at once, each of which can last up to an hour.",
                        "The spell can produce larger sensory effects and illusions. Visuals effects and illusions can be up to 10 feet in diameter and sensory effects can include other magical trappings, such as the ground rumbling, rushing winds, mystical glowing, levitating rocks, and so on.",
                        "You can use the cantrip to appear to cast much more powerful spells. When you do so, choose a spell effect to emulate within 120 feet and make a Charisma (Deception) roll contested by a Wisdom (Insight) check of anyone witnessing it. You have advantage on the roll if the creature observing it is not proficient with the Arcana skill. You instead have disadvantage on the roll if the emulated spell directly interacts with the creature or the spell contradicts itself. For example, if you choose to emulate the effect of the spell {@spell sleet storm|PHB| sleet storm} (sheets of freezing rain), you have disadvantage on the check if the spell's radius includes the viewer (since the viewer would realize that the spell's effects are intangible), or if they noticed that the spell did not create wet ground (since that contradicts the nature of the spell.) If you succeed, the target believes that you cast the spell."
                    ]
                }
            ]
        },
        {
            "name": "Master Thrower",
            "source": "FftF",
            "prerequisite": [
                {
                    "ability":[
                        {
                            "dex": 13
                        }
                    ]
                }
            ],
            "entries": [
                "You are an expert in using thrown weapons. You gain the following benefits:",
                {
                    "type": "list",
                    "items": [
                        "When you take the {@action Attack} action on your turn, you can use a bonus action to make a ranged attack with a thrown weapon.",
                        "When you make a ranged weapon attack, you can draw the weapon as part of the attack. You can draw any number of weapons in this fashion each round.",
                        "The short and long ranges of your thrown weapons doubles."
                    ]
                }
            ]
        }
    ]
}
